#### MathComparisonUtils Members

---

|  |
| --- |
| MathComparisonUtils Class   Methods   See Also |

The  MathComparisonUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsAlmostEqual | Checks if two doubles are almost equal, using the internal tolerance. |
| Public method Static member | IsAlmostZero | Checks if value is almost zero, using the internal tolerance. |
| Public method Static member | IsGreaterThan | Checks if value1 is strictly greater than value2, using the internal tolerance. |
| Public method Static member | IsGreaterThanOrAlmostEqual | Checks if value1 is greater than or almost equal to value2, using the internal tolerance. |
| Public method Static member | IsLessThan | Checks if value1 is strictly less than value2, using the internal tolerance. |
| Public method Static member | IsLessThanOrAlmostEqual | Checks if value1 is less than or almost equal to value2, using the internal tolerance. |

# See Also

MathComparisonUtils Class

Autodesk.Revit.DB Namespace